information-technology/project-configuration/yaml/yaml.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-21 Thu 14:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mike Chyson" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org21de49b">1. What is YAML</a></li>
<li><a href="#org6c2fe0e">2. What is YAML for?</a></li>
<li><a href="#orgd8e5cac">3. Relationship with XML and JSON</a></li>
<li><a href="#orgd6acc60">4. Syntax</a></li>
<li><a href="#org4a7599e">5. Example</a></li>
</ul>
</div>
</div>
<div id="outline-container-org21de49b" class="outline-2">
<h2 id="org21de49b"><span class="section-number-2">1</span> What is YAML</h2>
<div class="outline-text-2" id="text-1">
<p>
YAML (a recursive acronym for "YAML Ain't Markup Language") is a human-readable data-serialization language. I<br />
</p>
</div>
</div>

<div id="outline-container-org6c2fe0e" class="outline-2">
<h2 id="org6c2fe0e"><span class="section-number-2">2</span> What is YAML for?</h2>
<div class="outline-text-2" id="text-2">
<p>
For configuration files and in applications where data is being stored or transmitted.<br />
</p>
</div>
</div>

<div id="outline-container-orgd8e5cac" class="outline-2">
<h2 id="orgd8e5cac"><span class="section-number-2">3</span> Relationship with XML and JSON</h2>
<div class="outline-text-2" id="text-3">
<p>
vs XML: minimal syntax which intentionally differs from SGML <br />
vs JSON: superset of JSON<br />
</p>
</div>
</div>

<div id="outline-container-orgd6acc60" class="outline-2">
<h2 id="orgd6acc60"><span class="section-number-2">4</span> Syntax</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Whitespace indentation is used for denoting structure; however, tab characters are not allowed as part of indentation.<br /></li>
<li>Comments begin with the number sign (#), can start anywhere on a line and continue until the end of the line.<br /></li>
<li>List members are denoted by a leading hyphen (-) with one member per line.<br />
<ul class="org-ul">
<li>A list can also be specified by enclosing text in square brackets ([ ]) with each entry separated by commas.<br /></li>
</ul></li>
<li>An associative array entry is represented using colon space in the form key: value with one entry per line.<br />
<ul class="org-ul">
<li>A question mark can be used in front of a key, in the form "?key: value" to allow the key to contain leading dashes, square brackets, etc., without quotes.<br /></li>
<li>An associative array can also be specified by text enclosed in curly braces ({ }), with keys separated from values by colon and the entries separated by commas<br /></li>
</ul></li>
<li>Strings (scalars) are ordinarily unquoted, but may be enclosed in double-quotes ("), or single-quotes (').<br /></li>
<li>Block scalars are delimited with indentation with optional modifiers to preserve (|) or fold (&gt;) newlines.<br /></li>
<li>Multiple documents within a single stream are separated by three hyphens (&#x2014;).<br />
<ul class="org-ul">
<li>Three periods (&#x2026;) optionally end a document within a stream.<br /></li>
</ul></li>
<li>Repeated nodes are initially denoted by an ampersand (&amp;) and thereafter referenced with an asterisk (*).<br /></li>
<li>Nodes may be labeled with a type or tag using the exclamation point (!!) followed by a string, which can be expanded into a URI.<br /></li>
</ul>
</div>
</div>


<div id="outline-container-org4a7599e" class="outline-2">
<h2 id="org4a7599e"><span class="section-number-2">5</span> Example</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
--- # multiple documents within a single stream
- a # list
- b
- c
---
[a, b, c] # inline list
---
name: Mike Chyson # key-value pair
age: 32
---
{name: Mike Chyson, age: 32} # inline key-value pair
---
data: |
  hello # string
---
data: &gt;
  hello # string
---
# folded text converts newlines to spaces and removes leading whitespace
- {name: Mike, age: 32}
- name: Mike
  age: 32
- [name, age]: [Mike, 32]
---
- step: &amp;id001 # define anchor label
    instrument: Lasik 200
    pulseEnegy: 5.4
    pulseDuration: 12
    repetition: 1000
    spotSize: 1mm
- step: &amp;id002
    instrument:      Lasik 2000
    pulseEnergy:     5.0
    pulseDuration:   10
    repetition:      500
    spotSize:        2mm
- step: *id001
- step: *id002
- step: *id002
--- # built-in data types use a double-exclamation sigil prefix (!!).
a: 123                     # an integer
b: "123"                   # a string, disambiguated by quotes
c: 123.0                   # a float
d: !!float 123             # also a float via explicit data type prefixed by (!!)
e: !!str 123               # a string, disambiguated by explicit type
f: !!str Yes               # a string via explicit type
g: Yes                     # a boolean True (yaml1.1), string "Yes" (yaml1.2)
h: Yes we have No bananas  # a string, "Yes" and "No" disambiguated by context.
---
picture: !!binary |
  R0lGODdhDQAIAIAAAAAAANn
  Z2SwAAAAADQAIAAACF4SDGQ
  ar3xxbJ9p0qa7R0YxwzaFME
  1IAADs=
--- # Local data types use a single exclamation mark (!).
myObject:  !myClass { name: Joe, age: 15 }


</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mike Chyson</p>
<p class="date">Created: 2020-05-21 Thu 14:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
